import type { QuizQuestion } from "@/types/quiz";

export const quizQuestions: QuizQuestion[] = [
	{
		id: 1,
		type: "sms",
		scenario:
			"คุณได้รับ SMS จาก 'ธนาคาร' แจ้งว่ามีคนพยายามเข้าใช้งานบัญชีของคุณจากอุปกรณ์อื่น พร้อมแนบลิงก์ให้คลิกเพื่อยืนยันตัวตนและป้องกันการถูกขโมยเงิน หากคุณไม่ดำเนินการอาจมีความเสี่ยงที่เงินในบัญชีจะสูญหาย คุณจะทำอย่างไร?",
		content:
			"มีผู้เข้าสู่ระบบบัญชีธนาคารของคุณจากอุปกรณ์อื่นโปรดติดต่อทันที kasigorn.go-line.cc",
		redflag: "kasigorn.go-line.cc",
		choices: [
			{
				id: "1a",
				text: "ไม่คลิก รู้ว่าธนาคารไม่ส่งลิงก์",
				isCorrect: true,
				personality: "careful",
			},
			{
				id: "1b",
				text: "ลิงก์แปลก ไม่เหมือนวิธีธนาคาร",
				isCorrect: true,
				personality: "careful",
			},
			{
				id: "1c",
				text: "รีบคลิก กลัวเงินหายจากบัญชี",
				isCorrect: false,
				personality: "trusting",
			},
			{
				id: "1d",
				text: "คลิกลิงก์ก็ทำตามขั้นตอน",
				isCorrect: false,
				personality: "trusting",
			},
		],
		explanation: {
			correct:
				"ธนาคารจริงจะไม่ส่งลิงก์ผ่าน SMS และจะไม่แนบลิงก์เด็ดขาด สังเกตได้จากชื่อเว็บไซต์ที่ดูแปลกหรือเลียนแบบ เมื่อกดลิงก์จะถูกพาไปเพิ่มเพื่อนในไลน์จากนั้นมิจฉาชีพจะชวนคุยและหลอกให้ติดตั้งแอปปลอม ซึ่งสามารถดูดเงินจากบัญชีคุณได้โดยไม่รู้ตัว",
			incorrect:
				"การคลิกลิงก์ที่ไม่รู้จักอาจนำไปสู่การถูกหลอกลวง ธนาคารจริงจะไม่ส่งลิงก์ผ่าน SMS ควรติดต่อธนาคารโดยตรงผ่านช่องทางอย่างเป็นทางการ",
			redFlags: [
				"ลิงก์ปลอม kasigorn.go-line.cc",
				"ธนาคารไม่ส่งลิงก์ผ่าน SMS",
				"สร้างความเร่งรีบและความกลัว",
			],
		},
	},
	{
		id: 2,
		type: "ads",
		scenario:
			"ถ้าคุณกำลังต้องการเงิน และค้นหาแอพเงินกู้ แล้วเจอโฆษณาแบบนี้ คุณจะทำอย่างไร?",
		content:
			"เงินสดด่วน อนุมัติไว\n\nไม่ตรวจสอบเครดิต\nไม่ต้องใช้เอกสารใดๆ\nดอกน้อยร้อยละ 0.5\nเงินเข้าใน 3 นาที",
		redflag: "เงินสดด่วน อนุมัติไว",
		image: "/public/ads-1.png",
		choices: [
			{
				id: "2a",
				text: "เช็คแอพในเว็บแบงก์ชาติก่อน",
				isCorrect: true,
				personality: "careful",
			},
			{
				id: "2b",
				text: "ไม่กู้ เงื่อนไขดูดีเกินจริง ปลอม",
				isCorrect: true,
				personality: "careful",
			},
			{
				id: "2c",
				text: "ลองโหลด ไม่ต้องเช็คเครดิต",
				isCorrect: false,
				personality: "trusting",
			},
			{
				id: "2d",
				text: "กู้เลย ค่อยคิดเรื่องดอกเบี้ยทีหลัง",
				isCorrect: false,
				personality: "trusting",
			},
		],
		explanation: {
			correct:
				"การเช็คแอพในเว็บไซต์ธนาคารแห่งประเทศไทยเป็นวิธีที่ดีที่สุดในการตรวจสอบความน่าเชื่อถือ แอพกู้เงินที่ถูกกฎหมายจะต้องได้รับใบอนุญาตและจดทะเบียนไว้อย่างถูกต้อง",
			incorrect:
				"แอพที่โฆษณาว่าง่าย อนุมัติไว ไม่เช็คเครดิต มักเป็น 'แอพกู้เงินโหด' ที่คิดดอกเบี้ยสูงมาก ห้าเงินก่อนจ่าย และบีบขมุลาเหยื่อไปติดหนี้ ควรตรวจสอบชื่อแอพในเว็บไซต์ธนาคารแห่งประเทศไทย เพื่อป้องกันการตกเป็นเหยื่อ",
			redFlags: [
				"ดอกเบี้ยต่ำผิดปกติ 0.5%",
				"ไม่ตรวจสอบเครดิต",
				"อนุมัติเร็วผิดปกติ 3 นาที",
				"ไม่ต้องมีเอกสาร",
			],
		},
	},
];
