import type { QuizQuestion } from "@/types/quiz";

export const quizQuestions: QuizQuestion[] = [
	{
		id: 1,
		type: "sms",
		scenario:
			"คุณได้รับ SMS จาก 'ธนาคาร' แจ้งว่ามีคนพยายามเข้าใช้งานบัญชีของคุณจากอุปกรณ์อื่น พร้อมแนบลิงก์ให้คลิกเพื่อยืนยันตัวตนและป้องกันการถูกขโมยเงิน หากคุณไม่ดำเนินการอาจมีความเสี่ยงที่เงินในบัญชีจะสูญหาย คุณจะทำอย่างไร?",
		content:
			"มีผู้เข้าสู่ระบบบัญชีธนาคารของคุณจากอุปกรณ์อื่นโปรดติดต่อทันที kasigorn.go-line.cc",
		redflag: "kasigorn.go-line.cc",
		choices: [
			{
				id: "1a",
				text: "ไม่คลิก รู้ว่าธนาคารไม่ส่งลิงก์",
				isCorrect: true,
				personality: "careful",
			},
			{
				id: "1b",
				text: "ลิงก์แปลก ไม่เหมือนวิธีธนาคาร",
				isCorrect: true,
				personality: "careful",
			},
			{
				id: "1c",
				text: "รีบคลิก กลัวเงินหายจากบัญชี",
				isCorrect: false,
				personality: "trusting",
			},
			{
				id: "1d",
				text: "คลิกลิงก์ก็ทำตามขั้นตอน",
				isCorrect: false,
				personality: "trusting",
			},
		],
		explanation: {
			correct:
				"ธนาคารจริงจะไม่ส่งลิงก์ผ่าน SMS และจะไม่แนบลิงก์เด็ดขาด สังเกตได้จากชื่อเว็บไซต์ที่ดูแปลกหรือเลียนแบบ เมื่อกดลิงก์จะถูกพาไปเพิ่มเพื่อนในไลน์จากนั้นมิจฉาชีพจะชวนคุยและหลอกให้ติดตั้งแอปปลอม ซึ่งสามารถดูดเงินจากบัญชีคุณได้โดยไม่รู้ตัว",
			incorrect:
				"การคลิกลิงก์ที่ไม่รู้จักอาจนำไปสู่การถูกหลอกลวง ธนาคารจริงจะไม่ส่งลิงก์ผ่าน SMS ควรติดต่อธนาคารโดยตรงผ่านช่องทางอย่างเป็นทางการ",
			redFlags: [
				"ลิงก์ปลอม kasigorn.go-line.cc",
				"ธนาคารไม่ส่งลิงก์ผ่าน SMS",
				"สร้างความเร่งรีบและความกลัว",
			],
		},
	},
	{
		id: 2,
		type: "ads",
		scenario: "ถ้าคุณเจอคนดัง โฆษณาชักชวนให้ร่วมลงทุน คุณจะ....?",
		content: "กำไรสูง 25% ต่อเดือน\nรับเงินได้ทันที\nไม่มีความเสี่ยง",
		redflag: "ลงทุนง่ายๆ\nการันตีผลตอบแทน",
		image: "/public/ads-2.png",
		choices: [
			{
				id: "2a",
				text: "ลงทุนทันที เพราะคนดังแนะนำ",
				isCorrect: true,
				personality: "trusting",
			},
			{
				id: "2b",
				text: "ลองโหลดแอพ มาติดตั้งดูก่อน",
				isCorrect: true,
				personality: "trusting",
			},
			{
				id: "2c",
				text: "ไม่ลงทุน เงื่อนไขไม่สมเหตุผล",
				isCorrect: false,
				personality: "careful",
			},
		],
		explanation: {
			correct:
				"คุณตัดสินใจถูกต้อง! การลงทุนที่แท้จริงไม่มีการ 'การันตีผลตอบแทน' และผลตอบแทน 20% ต่อเดือนเป็นสิ่งที่เป็นไปไม่ได้ในการลงทุนปกติ คนดังอาจถูกแฮ็คบัญชีหรือได้รับเงินจากนายหน้าเพื่อโฆษณาโดยไม่รู้ความจริง",
			incorrect:
				"การลงทุนที่อ้างว่า 'ลงทุนง่ายๆ' และ 'การันตีผลตอบแทน' เป็นสัญญาณเตือนของการลงทุนหลอกลวง ไม่มีการลงทุนใดที่สามารถการันตีผลตอบแทนได้ 100% และผลตอบแทน 20% ต่อเดือนนั้นสูงผิดปกติ แม้คนดังจะเป็นคนโฆษณาก็ไม่ได้หมายความว่าปลอดภัย",
			redFlags: [
				"การันตีผลตอบแทน 100%",
				"ผลตอบแทนสูงผิดปกติ 20% ต่อเดือน",
				"ใช้ชื่อเสียงคนดังเป็นเครื่องมือ",
				"เน้นความง่ายในการลงทุน",
				"ไม่มีการอธิบายความเสี่ยง",
			],
		},
	},
];
